#install directory
cask_args appdir: '/Applications'

# Taps
tap 'homebrew/bundle'
tap 'versent/homebrew-taps'
tap 'fluxcd/tap'
tap 'hashicorp/tap'

# Binaries
brew 'ack'
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroid
brew 'coreutils'
#brew 'cri-tools'
brew 'eza'
brew 'etcd'
brew 'autojump'
brew 'fzf'
brew 'fluxcd/tap/flux'
brew 'hashicorp/tap/vault'
brew 'helm'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'go'
brew 'kube-ps1'
brew 'kubectl'
brew 'kubectx'
brew 'kubectl'
brew 'kubeconform'
brew 'kubeseal'
brew 'k9s'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'vim'
brew 'pwgen'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'rg'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'wget'
brew 'yazi'
brew 'yamlfmt'
brew 'zsh'
brew 'zsh-completions'
brew 'fonts-powerline'

# terminal emulators
cask 'alacritty'
cask 'iterm2'
cask 'ghostty'

#Microsoft


#My apps
#brew 'putty'
#brew 'iproute2macs'
#brew 'kubernetes-helm'


#Terraform
brew 'saml2aws'
brew 'terraform'
brew 'ansible'

# Development
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'java'

#Browsers
cask 'arc'


# Apps
cask 'keepingyouawake'
cask 'rectangle'
cask 'slack'
cask 'istat-menus'
cask 'zoom'
cask 'whatsapp'
cask 'signal'
cask 'vlc'
cask 'visual-studio-code'
cask 'postico'
cask 'cleanshot'
cask 'screenflow'
cask 'obs'
cask 'imageoptim'
cask 'barrier'
cask 'discord'
cask 'monodraw'
cask 'docker'
cask 'google-cloud-sdk'
cask 'vagrant'
cask 'microsoft-remote-desktop'
cask 'wireshark'


#Fonts
cask 'font-hack'
cask 'font-jetbrains-mono'
cask 'font-inconsolata'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-ibm-plex'
cask 'font-source-code-pro'


#Microsoft
cask 'microsoft-outlook'
cask 'microsoft-word'
cask 'microsoft-powerpoint'
cask 'microsoft-excel'


#AppStore
#mas 'Microsoft Excel', id: 586683407
#mas 'Microsoft Outlook', id: 951937596
#mas 'Microsoft PowerPoint', id: 586449534
#mas 'Microsoft Word', id: 586447913
#mas 'Bitwarden', id: 1352778147
